var items = [
    {
        id:6,
        name:'榕树',
        belong:'桑科榕属乔木',
        desc:'榕树（学名：Ficus microcarpa Linn. f. ）：大乔木，高达15-25米，' +
                '胸径达50厘米，冠幅广展；老树常有锈褐色气根。树皮深灰色。叶薄革质，狭椭' +
                '圆形，表面深绿色，有光泽，全缘。榕果成对腋生或生于已落叶枝叶腋，成熟时' +
                '黄或微红色，扁球形，基生苞片3，广卵形，宿存；雄花、雌花、瘿花同生于一榕' +
                '果内，花间有少许短刚毛；花被片3，广卵形，花柱近侧生，柱头短，棒形。瘦' +
                '果卵圆形。花期5-6月。',
        feature:'榕树是大乔木，高达15-25米，胸径达50厘米，冠幅广展；老树常有锈' +
                '褐色气根。树皮深灰色。叶薄革质，狭椭圆形，长4-8厘米，宽3-4厘米，先端' +
                '钝尖，基部楔形，表面深绿色，干后深褐色，有光泽，全缘，基生叶脉延长，' +
                '侧脉3-10对；叶柄长5-10毫米，无毛；托叶小，披针形，长约8毫米。',
        growth:'榕树的适应性强，喜疏松肥沃的酸性土，在瘠薄的沙质土中也能生长，' +
                '在碱土中叶片黄化。不耐旱，较耐水湿，短时间水涝不会烂根。在干燥的气候' +
                '条件下生长不良，在潮湿的空气中能发生大气生根，使观赏价值大大提高。喜' +
                '阳光充足、温暖湿润气候，不耐寒，除华南地区外多作盆栽。对土壤要求不严' +
                '，在微酸和微碱性土中均能生长，怕烈日曝晒。',
        disease:'榕树的虫害主要有蚜虫、红蜘蛛、蚧等。用氧化乐果500PPM喷洒叶片' +
                '或50%亚胶硫磷可湿性粉剂1000倍溶液喷杀。用洗衣粉水或风油精水0.1%也很有效。',
    },
    {
        id:1,
        name:'挂花树',
        belong:'木樨科常绿乔木',
        desc:'桂花树（学名：Osmanthus fragrans）：桂花树又名木樨，为木樨科常绿乔木。' +
                '桂花原产中国西南部喜马拉雅山东段，印度、尼泊尔也有。在中国有2500年以上的栽培历' +
                '史，在黄河以南和广东的西南地区大量露地种植。桂花属长日照植物，喜在充足的阳光和土' +
                '层肥厚、排水良好的地方生长，土壤要微酸，PH5.5～6.5。忌碱土，怕积水和煤烟。北方' +
                '需盆栽，低温温室越冬，0℃左右的温度对盆栽的桂花不会有害。',
        feature:'常绿乔木或灌木，高3-5米，最高可达18米；树皮灰褐色。小枝黄褐色，无毛。\n' +
                '叶片革质，椭圆形、长椭圆形或椭圆状披针形，长7-14.5厘米，宽2.6-4.5厘米，先' +
                '端渐尖，基部渐狭呈楔形或宽楔形，全缘或通常上半部具细锯齿，两面无毛，腺点在' +
                '两面连成小水泡状突起，中脉在上面凹入，下面凸起，侧脉6-8对，多达10对，在上' +
                '面凹入，下面凸起；叶柄长0.8-1.2厘米，最长可达15厘米，无毛。\n' +
                '聚伞花序簇生于叶腋，或近于帚状，每腋内有花多朵；苞片宽卵形，质厚，' +
                '长2-4毫米，具小尖头，无毛；花梗细弱，长4-10毫米，无毛；花极芳香；花萼长约1' +
                '毫米，裂片稍不整齐；花冠黄白色、淡黄色、黄色或桔红色，长3-4毫米，花冠管仅长' +
                '0.5-1毫米；雄蕊着生于花冠管中部，花丝极短，长约0.5毫米，花药长约1毫米，药隔' +
                '在花药先端稍延伸呈不明显的小尖头；雌蕊长约1.5毫米，花柱长约0.5毫米。\n' +
                '果歪斜，椭圆形，长1-1.5厘米，呈紫黑色。花期9-10月上旬，果期翌年3月。',
        growth:'榕树的适应性强，喜疏松肥沃的酸性土，在瘠薄的沙质土中也能生长，在碱土中叶片黄' +
                '化。不耐旱，较耐水湿，短时间水涝不会烂根。在干燥的气候条件下生长不良，' +
                '在潮湿的空气中能发生大气生根，使观赏价值大大提高。喜阳光充足、温暖湿润气候，不耐寒' +
                '，除华南地区外多作盆栽。对土壤要求不严，在微酸和微碱性土中均能生长，怕烈日曝晒。',
        disease:'桂花树的病虫害主要有红蜘蛛、规划褐斑病、桂花枯斑病、桂花炭疽病',
    },
    {
        id:2,
        name:'榴莲树',
        belong:'常绿乔木',
        desc:'榴莲树（学名：Durio zibethinus Murr.）：榴莲树，常绿乔木。叶子长椭圆形，' +
                '表面光滑，背面生鳞片。果实球形，表面有很多硬刺，果肉味美，为热带著名果品之一。' +
                '原产马来西亚，我国广东﹑海南也有。常绿乔木，高可达25米，幼枝顶部有鳞片。托叶长' +
                '1.5-2厘米，叶片长圆形，有时倒卵状长圆形，短渐尖或急渐尖，基部圆形或钝，两面发亮' +
                '，上面光滑，背面有贴生鳞片，侧脉10-12对，长10-15厘米，宽3-5厘米；叶柄长1.5-2.8' +
                '厘米，聚伞花序细长下垂，簇生于茎上或大枝上，每序有花3-30朵；花蕾球形；花梗被鳞片，长2-4厘米。',
        feature:'苞片托住花萼，比花萼短，萼筒状，高2.5-3厘米，基部肿胀，内面密被柔毛，具5-6个短宽' +
                '的萼齿；花瓣黄白色，长3.5-5厘米，为萼长的2倍，长圆状匙形，后期外翻；雄蕊5束，每束有花丝4-' +
                '18，花丝基部合生1/4-1/2；蒴果椭圆状，淡黄色或黄绿色，长15-30厘米，粗13-15厘米，每室种子' +
                '2-6，假种皮白色或黄白色，有强烈的气味。花果期6-12月。',
        growth:'根据榴莲的物候学特征在日平均温度22℃ 以上，无霜冻的地区可以种植，中国海南省和云南省' +
                '的部分地区可以发展。因为榴莲要终年高温的气候才能生长结实，即使在赤道地区，海拔600m' +
                '以上的高地，由于气温下降，也不能种植榴莲或不能结果。上市季节在每年9-l2月，其他月份也有生产。',
        disease:'蚂蚁的病虫害主要有蚜虫、驻果虫、红蜘蛛、叶腐烂病、白根病等。',
            },
    {        id:3,
        name:'竹子',
        belong:'木樨科常绿乔木',
        desc:'竹子学名 Bambusoideae（Bambusaceae或Bamboo），在热带、亚热带地区，东亚、东南亚和印' +
                '度洋及太平洋岛屿上分布最集中，种类很多，有的低矮似草，有的高如大树，生长迅速。 通常通过地下匍' +
                '匐的根茎成片生长，也可以通过开花结籽繁衍，种子被称为竹米。有些种类的竹笋可以食用。竹枝杆挺' +
                '拔，修长，四季青翠，傲雪凌霜，倍受中国人喜爱，与梅、兰、菊并称为四君子，与梅、松并称为岁寒三' +
                '友，古今文人墨客，爱竹咏竹者众多。',
        feature:'竹子是一种速生型草本植物，其竹叶呈狭披针形，长7.5～16厘米，竹叶竹叶(7张)宽1～2厘米' +
                '，先端渐尖，基部钝形，叶柄长约5毫米，边缘之一侧较平滑，另一侧具小锯齿而粗糙；平行脉，次脉6～' +
                '8对，小横脉甚显著；叶面深绿色，无毛，背面色较淡，基部具微毛；质薄而较脆。竹笋长10至30cm，' +
                '成年竹通体碧绿节数一般在10至15节之间。',
        growth:'竹类大都喜温暖湿润的气候盛产于热带、亚热带和温带地区。竹子是森林资源之一。全世界竹' +
                '类植物约有70多属1,200多种，主要分布在热带及亚热带地区，少数竹类分布在温带和寒带。竹子是常' +
                '绿(少数竹种在旱季落叶)浅根性植物，对水热条件要求高，而且非常敏感，地球表面的水热分布支配着' +
                '竹子的地理分布。东南亚位于热带和南亚热带，又受太平洋和印度洋季风汇集的影晌，雨量充沛，热量' +
                '稳定，是竹子生长理想的生态环境，也是世界竹子分布的中心。目前全世界竹林面权约2,200万hm2。' +
                '世界的竹子地理分布可分为3大竹区，即亚太竹区、美洲竹区和非洲竹区，有些学者还单列，欧洲、' +
                '北美引种区”。竹子在下雨后生长的很快。',
        disease:'竹子的虫害主要有蚜虫、竹螨、竹螟竹蝗等。',
    },
    {
        id:4,
        name:'柳树',
        belong:'灌木，稀乔木',
        desc:'柳树（学名：Salix babylonica）：柳树是一类植物的总称：旱柳 Salix matsudana Koidz.' +
                '、腺柳 Salix chaenomeloides Kimura、垂柳 Salix babylonica Linn.柳属多为灌木，稀乔木，无顶芽，合轴' +
                '分枝，雄蕊数目较少，虫媒花等特征表明，较杨属与钻天柳属进化。本属世界约520多种，主产北半球温带地' +
                '区，寒带次之，热带和南半球极少，大洋洲无野生种。我国有257种，122变种，33变型。各省区均产。',
        feature:'柳属的形态特征如下：乔木或匍匐状、垫状、直立灌木。枝圆柱形，髓心近圆形。无顶芽，侧芽通常紧' +
                '贴枝上，芽鳞单一。叶互生，稀对生，通常狭而长，多为披针形，羽状脉，有锯齿或全缘；叶柄短；具托叶，多' +
                '有锯齿，常早落，稀宿存。葇荑花序直立或斜展，先叶开放，或与叶同时开放，稀后叶开放；苞片全缘，有毛或' +
                '无毛，宿存，稀早落；雄蕊2-多数，花丝离生或部分或全部合；腺体1-2（位于花序轴与花丝之间者为腹腺，近苞' +
                '片者为背腺）；雌蕊由2心皮组成，子房无柄或有柄，花柱长短不一，或缺，单1或分裂，柱头1-2，分裂或不' +
                '裂。蒴果2瓣裂；种子小。多暗褐色。',
        growth:'柳树属于广生态幅植物，对环境的适应性很广，喜光，喜湿，耐寒，是中生偏湿树种。但一些种也较耐' +
                '旱和耐盐碱，在生态条件较恶劣的地方能够生长，在立地条件优越的平原沃野，生长更好。一般寿命为20～30年' +
                '，少数种可达百年以上。一年中生长期较长，发芽早，落叶晚，南方个别种为常绿树。',
        disease:'柳树的病虫害主要有柳瘿蚊、柳锈病、黑绒金龟子、杨毒蛾等。',
    },
    {
        id:5,
        name:'梅',
        belong:'蔷薇科杏属植物,小乔木',
        desc:'梅（学名：Armeniaca mume Sieb.）：小乔木，稀灌木，高4-10米；树皮浅灰色或带绿色，平滑；小枝绿色，光滑无毛,' +
        '叶片卵形或椭圆形，叶边常具小锐锯齿，灰绿色。花单生或有时2朵同生于1芽内，直径2-2.5厘米，香味浓，先于叶开放；花萼通常' +
        '红褐色，但有些品种的花萼为绿色或绿紫色；花瓣倒卵形，白色至粉红色。果实近球形，直径2-3厘米，黄色或绿白色，被柔毛，味酸' +
        '；果肉与核粘贴；核椭圆形，两侧微扁。花期冬春季，果期5-6月。2n=16，24。',
        feature:'梅是小乔木，稀灌木，高4-10米；树皮浅灰色或带绿色，平滑；小枝绿色，光滑无毛。叶片卵形或椭圆形，长4-8厘米，宽2.5' +
        '-5厘米，先端尾尖，基部宽楔形至圆形，叶边常具小锐锯齿，灰绿色，幼嫩时两面被短柔毛，成长时逐渐脱落，或仅下面脉腋间具短柔毛；' +
        '叶柄长1-2厘米，幼时具毛，老时脱落，常有腺体。',
        growth:'梅喜温暖气候，花期对气候变化特别敏感。梅喜空气湿度较大，但花期忌暴雨。梅在年雨量1000mm或稍多地区' +
                '可生长良好对土壤要求不严，较耐瘠薄。阳性树种，喜阳光充足，通风良好。为长寿树种。长江流域花期12月至翌年3月。',
        disease:'梅树的病虫害主要有炭疽病、毛毡病、缩叶病、红蜘蛛、蚜虫、毛虫等。',
    },
];

var comments = [
    {
        id:1,
        avator:'../img/avator1.jpg',
        name:'从零开始',
        text:'汉皇重色思倾国，御宇多年求不得',
        time:'2018-06-10 15:00',
    },
    {
        id:2,
        avator:'../img/avator2.jpg',
        name:'KAI(SO4)2·12H20',
        text:'杨家有女初长成，养在深闺人不知',
        time:'2018-06-10 15:00',
    },
    {
        id:3,
        avator:'../img/avator3.jpg',
        name:'啷里格啷',
        text:'天生丽质难自弃，一朝选在君王侧',
        time:'2018-06-10 15:00',
    }
]

function getItemByID(id) {
        for (item in items) {
            if (items[item].id === id) {
                return items[item];
            }
        }
        return null;
};

function getComments(id) {
    return comments;
}

function setComments(id,comments) {
    this.comments = comments;
}

function getQueryString(name)
{
    var reg = new RegExp("(^|&)"+ name +"=([^&]*)(&|$)");
    var r = window.location.search.substr(1).match(reg);
    if(r!=null)return  unescape(r[2]); return null;
}
