var hotitems = [
    {
        id:6,
        name:'榕树',
        belong:'桑科榕属乔木',
        englishName:'rongshu',
        item_images:['./img/rongshu1.jpg','./img/rongshu2.jpg','./img/rongshu3.jpg'],
        desc:'榕树（学名：Ficus microcarpa Linn. f. ）：大乔木，高达15-25米，' +
                '胸径达50厘米，冠幅广展；老树常有锈褐色气根。树皮深灰色。叶薄革质，狭椭' +
                '圆形，表面深绿色，有光泽，全缘。榕果成对腋生或生于已落叶枝叶腋，成熟时' +
                '黄或微红色，扁球形，基生苞片3，广卵形，宿存；雄花、雌花、瘿花同生于一榕' +
                '果内，花间有少许短刚毛；花被片3，广卵形，花柱近侧生，柱头短，棒形。瘦' +
                '果卵圆形。花期5-6月。',
        feature:'榕树是大乔木，高达15-25米，胸径达50厘米，冠幅广展；老树常有锈' +
                '褐色气根。树皮深灰色。叶薄革质，狭椭圆形，长4-8厘米，宽3-4厘米，先端' +
                '钝尖，基部楔形，表面深绿色，干后深褐色，有光泽，全缘，基生叶脉延长，' +
                '侧脉3-10对；叶柄长5-10毫米，无毛；托叶小，披针形，长约8毫米。',
        growth:'榕树的适应性强，喜疏松肥沃的酸性土，在瘠薄的沙质土中也能生长，' +
                '在碱土中叶片黄化。不耐旱，较耐水湿，短时间水涝不会烂根。在干燥的气候' +
                '条件下生长不良，在潮湿的空气中能发生大气生根，使观赏价值大大提高。喜' +
                '阳光充足、温暖湿润气候，不耐寒，除华南地区外多作盆栽。对土壤要求不严' +
                '，在微酸和微碱性土中均能生长，怕烈日曝晒。',
        disease:'榕树的虫害主要有蚜虫、红蜘蛛、蚧等。用氧化乐果500PPM喷洒叶片' +
                '或50%亚胶硫磷可湿性粉剂1000倍溶液喷杀。用洗衣粉水或风油精水0.1%也很有效。',
    },
    {
        id:1,
        name:'挂花树',
        belong:'木樨科常绿乔木',
        englishName:'guihuashu',
        item_images:['./img/guihuashu1.jpg'],
        desc:'桂花树（学名：Osmanthus fragrans）：桂花树又名木樨，为木樨科常绿乔木。' +
                '桂花原产中国西南部喜马拉雅山东段，印度、尼泊尔也有。在中国有2500年以上的栽培历' +
                '史，在黄河以南和广东的西南地区大量露地种植。桂花属长日照植物，喜在充足的阳光和土' +
                '层肥厚、排水良好的地方生长，土壤要微酸，PH5.5～6.5。忌碱土，怕积水和煤烟。北方' +
                '需盆栽，低温温室越冬，0℃左右的温度对盆栽的桂花不会有害。',
        feature:'常绿乔木或灌木，高3-5米，最高可达18米；树皮灰褐色。小枝黄褐色，无毛。' +
                '叶片革质，椭圆形、长椭圆形或椭圆状披针形，长7-14.5厘米，宽2.6-4.5厘米，先' +
                '端渐尖，基部渐狭呈楔形或宽楔形，全缘或通常上半部具细锯齿，两面无毛，腺点在' +
                '两面连成小水泡状突起，中脉在上面凹入，下面凸起，侧脉6-8对，多达10对，在上' +
                '面凹入，下面凸起；叶柄长0.8-1.2厘米，最长可达15厘米，无毛。' +
                '聚伞花序簇生于叶腋，或近于帚状，每腋内有花多朵；苞片宽卵形，质厚，' +
                '长2-4毫米，具小尖头，无毛；花梗细弱，长4-10毫米，无毛；花极芳香；花萼长约1' +
                '毫米，裂片稍不整齐；花冠黄白色、淡黄色、黄色或桔红色，长3-4毫米，花冠管仅长' +
                '0.5-1毫米；雄蕊着生于花冠管中部，花丝极短，长约0.5毫米，花药长约1毫米，药隔' +
                '在花药先端稍延伸呈不明显的小尖头；雌蕊长约1.5毫米，花柱长约0.5毫米。' +
                '果歪斜，椭圆形，长1-1.5厘米，呈紫黑色。花期9-10月上旬，果期翌年3月。',
        growth:'榕树的适应性强，喜疏松肥沃的酸性土，在瘠薄的沙质土中也能生长，在碱土中叶片黄' +
                '化。不耐旱，较耐水湿，短时间水涝不会烂根。在干燥的气候条件下生长不良，' +
                '在潮湿的空气中能发生大气生根，使观赏价值大大提高。喜阳光充足、温暖湿润气候，不耐寒' +
                '，除华南地区外多作盆栽。对土壤要求不严，在微酸和微碱性土中均能生长，怕烈日曝晒。',
        disease:'桂花树的病虫害主要有红蜘蛛、规划褐斑病、桂花枯斑病、桂花炭疽病',
    },
    {
        id:2,
        name:'榴莲树',
        belong:'常绿乔木',
        englishName:'liulianshu',
        item_images:['./img/liulianshu1.jpg'],
        desc:'榴莲树（学名：Durio zibethinus Murr.）：榴莲树，常绿乔木。叶子长椭圆形，' +
                '表面光滑，背面生鳞片。果实球形，表面有很多硬刺，果肉味美，为热带著名果品之一。' +
                '原产马来西亚，我国广东﹑海南也有。常绿乔木，高可达25米，幼枝顶部有鳞片。托叶长' +
                '1.5-2厘米，叶片长圆形，有时倒卵状长圆形，短渐尖或急渐尖，基部圆形或钝，两面发亮' +
                '，上面光滑，背面有贴生鳞片，侧脉10-12对，长10-15厘米，宽3-5厘米；叶柄长1.5-2.8' +
                '厘米，聚伞花序细长下垂，簇生于茎上或大枝上，每序有花3-30朵；花蕾球形；花梗被鳞片，长2-4厘米。',
        feature:'苞片托住花萼，比花萼短，萼筒状，高2.5-3厘米，基部肿胀，内面密被柔毛，具5-6个短宽' +
                '的萼齿；花瓣黄白色，长3.5-5厘米，为萼长的2倍，长圆状匙形，后期外翻；雄蕊5束，每束有花丝4-' +
                '18，花丝基部合生1/4-1/2；蒴果椭圆状，淡黄色或黄绿色，长15-30厘米，粗13-15厘米，每室种子' +
                '2-6，假种皮白色或黄白色，有强烈的气味。花果期6-12月。',
        growth:'根据榴莲的物候学特征在日平均温度22℃ 以上，无霜冻的地区可以种植，中国海南省和云南省' +
                '的部分地区可以发展。因为榴莲要终年高温的气候才能生长结实，即使在赤道地区，海拔600m' +
                '以上的高地，由于气温下降，也不能种植榴莲或不能结果。上市季节在每年9-l2月，其他月份也有生产。',
        disease:'蚂蚁的病虫害主要有蚜虫、驻果虫、红蜘蛛、叶腐烂病、白根病等。',
            },
    {        id:3,
        name:'竹子',
        belong:'木樨科常绿乔木',
        englishName:'zhuzi',
        item_images:['./img/zhuzi1.jpg'],
        desc:'竹子学名 Bambusoideae（Bambusaceae或Bamboo），在热带、亚热带地区，东亚、东南亚和印' +
                '度洋及太平洋岛屿上分布最集中，种类很多，有的低矮似草，有的高如大树，生长迅速。 通常通过地下匍' +
                '匐的根茎成片生长，也可以通过开花结籽繁衍，种子被称为竹米。有些种类的竹笋可以食用。竹枝杆挺' +
                '拔，修长，四季青翠，傲雪凌霜，倍受中国人喜爱，与梅、兰、菊并称为四君子，与梅、松并称为岁寒三' +
                '友，古今文人墨客，爱竹咏竹者众多。',
        feature:'竹子是一种速生型草本植物，其竹叶呈狭披针形，长7.5～16厘米，竹叶竹叶(7张)宽1～2厘米' +
                '，先端渐尖，基部钝形，叶柄长约5毫米，边缘之一侧较平滑，另一侧具小锯齿而粗糙；平行脉，次脉6～' +
                '8对，小横脉甚显著；叶面深绿色，无毛，背面色较淡，基部具微毛；质薄而较脆。竹笋长10至30cm，' +
                '成年竹通体碧绿节数一般在10至15节之间。',
        growth:'竹类大都喜温暖湿润的气候盛产于热带、亚热带和温带地区。竹子是森林资源之一。全世界竹' +
                '类植物约有70多属1,200多种，主要分布在热带及亚热带地区，少数竹类分布在温带和寒带。竹子是常' +
                '绿(少数竹种在旱季落叶)浅根性植物，对水热条件要求高，而且非常敏感，地球表面的水热分布支配着' +
                '竹子的地理分布。东南亚位于热带和南亚热带，又受太平洋和印度洋季风汇集的影晌，雨量充沛，热量' +
                '稳定，是竹子生长理想的生态环境，也是世界竹子分布的中心。目前全世界竹林面权约2,200万hm2。' +
                '世界的竹子地理分布可分为3大竹区，即亚太竹区、美洲竹区和非洲竹区，有些学者还单列，欧洲、' +
                '北美引种区”。竹子在下雨后生长的很快。',
        disease:'竹子的虫害主要有蚜虫、竹螨、竹螟竹蝗等。',
    },
    {
        id:4,
        name:'柳树',
        belong:'灌木，稀乔木',
        englishName:'liushu',
        item_images:['./img/liushu1.jpg'],
        desc:'柳树（学名：Salix babylonica）：柳树是一类植物的总称：旱柳 Salix matsudana Koidz.' +
                '、腺柳 Salix chaenomeloides Kimura、垂柳 Salix babylonica Linn.柳属多为灌木，稀乔木，无顶芽，合轴' +
                '分枝，雄蕊数目较少，虫媒花等特征表明，较杨属与钻天柳属进化。本属世界约520多种，主产北半球温带地' +
                '区，寒带次之，热带和南半球极少，大洋洲无野生种。我国有257种，122变种，33变型。各省区均产。',
        feature:'柳属的形态特征如下：乔木或匍匐状、垫状、直立灌木。枝圆柱形，髓心近圆形。无顶芽，侧芽通常紧' +
                '贴枝上，芽鳞单一。叶互生，稀对生，通常狭而长，多为披针形，羽状脉，有锯齿或全缘；叶柄短；具托叶，多' +
                '有锯齿，常早落，稀宿存。葇荑花序直立或斜展，先叶开放，或与叶同时开放，稀后叶开放；苞片全缘，有毛或' +
                '无毛，宿存，稀早落；雄蕊2-多数，花丝离生或部分或全部合；腺体1-2（位于花序轴与花丝之间者为腹腺，近苞' +
                '片者为背腺）；雌蕊由2心皮组成，子房无柄或有柄，花柱长短不一，或缺，单1或分裂，柱头1-2，分裂或不' +
                '裂。蒴果2瓣裂；种子小。多暗褐色。',
        growth:'柳树属于广生态幅植物，对环境的适应性很广，喜光，喜湿，耐寒，是中生偏湿树种。但一些种也较耐' +
                '旱和耐盐碱，在生态条件较恶劣的地方能够生长，在立地条件优越的平原沃野，生长更好。一般寿命为20～30年' +
                '，少数种可达百年以上。一年中生长期较长，发芽早，落叶晚，南方个别种为常绿树。',
        disease:'柳树的病虫害主要有柳瘿蚊、柳锈病、黑绒金龟子、杨毒蛾等。',
    },
    {
        id:5,
        name:'梅',
        englishName:'mei',
        belong:'蔷薇科杏属植物,小乔木',
        item_images:['./img/mei1.jpg'],
        desc:'梅（学名：Armeniaca mume Sieb.）：小乔木，稀灌木，高4-10米；树皮浅灰色或带绿色，平滑；小枝绿色，光滑无毛,' +
        '叶片卵形或椭圆形，叶边常具小锐锯齿，灰绿色。花单生或有时2朵同生于1芽内，直径2-2.5厘米，香味浓，先于叶开放；花萼通常' +
        '红褐色，但有些品种的花萼为绿色或绿紫色；花瓣倒卵形，白色至粉红色。果实近球形，直径2-3厘米，黄色或绿白色，被柔毛，味酸' +
        '；果肉与核粘贴；核椭圆形，两侧微扁。花期冬春季，果期5-6月。2n=16，24。',
        feature:'梅是小乔木，稀灌木，高4-10米；树皮浅灰色或带绿色，平滑；小枝绿色，光滑无毛。叶片卵形或椭圆形，长4-8厘米，宽2.5' +
        '-5厘米，先端尾尖，基部宽楔形至圆形，叶边常具小锐锯齿，灰绿色，幼嫩时两面被短柔毛，成长时逐渐脱落，或仅下面脉腋间具短柔毛；' +
        '叶柄长1-2厘米，幼时具毛，老时脱落，常有腺体。',
        growth:'梅喜温暖气候，花期对气候变化特别敏感。梅喜空气湿度较大，但花期忌暴雨。梅在年雨量1000mm或稍多地区' +
                '可生长良好对土壤要求不严，较耐瘠薄。阳性树种，喜阳光充足，通风良好。为长寿树种。长江流域花期12月至翌年3月。',
        disease:'梅树的病虫害主要有炭疽病、毛毡病、缩叶病、红蜘蛛、蚜虫、毛虫等。',
    },
];


var wormitems = [
    {
        id:1002,
        name:'蚧壳虫',
        englishName:'Scale beetle',
        item_images:['./img/4.jpg','./img/5.jpg','./img/6.jpg'],
        desc:'蚧壳虫，又名“介壳虫”。介壳虫是柑桔、柚子上的一类重要害虫，常见的有' +
        '红圆蚧、褐圆蚧、康片蚧、矢尖蚧和吹绵蚧等。介壳虫危害叶片、枝条和果实。介壳' +
        '虫往往是雄性有翅，能飞，雌虫和幼虫一经羽化，终生寄居在枝叶或果实上，造成叶' +
        '片发黄、枝梢枯萎、树势衰退，且易诱发煤污病。',
        feature:'卵：椭圆形，长径0.2~0.3mm。初产淡粉红色，渐变淡黄褐色，孵化前为橘红' +
        '色。若虫：扁卵圆形，淡黄褐色，体长0.3mm左右。触角5节，腹末端具2根尾毛。两眼' +
        '间有2个腺孔，分泌棉絮状毛覆盖身体。脱皮后眼、触角、足、尾毛均退化或消失，开' +
        '始分泌介壳，第1次蜕皮负于介壳上，称壳点。成虫：雌成虫介壳圆形，中央隆起、白' +
        '色，直径2.0~2.5mm，壳点黄色，位于介壳正面中央稍偏旁。壳下虫体成心脏形，上下' +
        '偏平，体长约1.0mm，淡黄或橘红色，臀板区深褐色，分节明显，节喙略突出。触角退' +
        '化成瘤状，其上各生刚毛1条。前气门腺15个，排成半月形群。围阴腺5组均发达。臀板' +
        '周缘共有4对对分的臀叶，以第一对最发达。雄成虫介壳鸭嘴状，长1.3mm，壳点橘红色' +
        '，位于端首，其余部分蜡质洁白色，表面有3条纵隆起，末端上下横裂成两层。雄成虫' +
        '体略呈长纺锤形，长0.6~0.7mm，翅展1.3mm，橙黄色。触角10节，念珠状，上生很多' +
        '毛。腹部长，末端尖削，端部具1性刺交配器。',
        growth:'蚧壳虫是园林植物主要害虫种类之一，在我国危害园林植物的蚧壳虫约600余种， 目前' +
        '危害长春市园林树木较为严重的有6种， 主要有白蜡蚧、朝鲜毛球蚧、圆盾蚧、水木坚蚧、考氏' +
        '白盾蚧、桑白盾蚧。蚧壳虫在我市主要为害女贞、山杏、京桃、糖槭等树种， 造成枝叶发黄、' +
        '畸形、叶片脱落, 严重者导致整株死亡, 严重影响树木的正常生长及园林绿化效果',
        PestControl:'针对蚧壳虫的形态特点， 对该类害虫的防治首选具有超强的内吸和渗透作用的药剂， ' +
        '如“蚧必治”750～1000倍液喷施， 药液经树体吸收后， 蚧壳虫吮吸到有毒的树体汁液中毒死亡' +
        '，杀虫效果好。用药建议在温度较高(要求在28℃～32℃， 因此温度药液传导快， 蚧壳虫易中' +
        '毒，且该温度下蜡质层变软， 利于药液渗透虫体)的下午使用， 连喷两次， 间隔期为5～7d。' +
        '对高大、药液很难喷到的树木， 可采用在树干中上部打孔注射“树体杀虫剂”， 药液通过木' +
        '质部导管输送传导到顶部， 对虫龄大、蜡质层厚及难防治的蚧壳虫效果明显， 操作简单， 防治彻底。',
    },
    {
        id:1004,
        name:'毛毛虫',
        englishName:'carpenterworm',
        item_images:['./img/10.jpg','./img/11.jpg','./img/12.jpg'],
        desc:'毛毛虫一般指鳞翅目（蛾类和蝶类）昆虫的幼虫。具3对胸足，腹足和尾足大多为5对，有的幼虫' +
        '身上有很多有毒的刚毛，人碰到的话皮肤会红肿。',
        feature:'鳞翅目（Lepidoptera）是昆虫纲中最常见的一目。色彩美丽，成虫体肢和翅满被鳞片和毛，' +
        '故2对翅为鳞翅，且前翅大于后翅；虹吸式口器（原始的小翅蛾类上颚发达，为咀嚼式）；触角丝状' +
        '、双栉状、栉状、棍棒状等多型；复眼发达，单眼2个或无单眼。幼虫也叫毛毛虫，蠕虫状，具3对胸' +
        '足，腹足和尾足大多为5对。幼虫体上生有刚毛，对刚毛的排列和命名称毛序，在分类上有重要意义' +
        '。约有112000种，包括蛾类和蝶类。有些可作鱼饵、喂鱼',
        growth:'urbulent phosphila毛毛虫 聚集在它们栖息的植物上。如果这群毛虫受到天敌攻击，它们会' +
        '采取像《黑客帝国》三部曲里看到的一系列防御措施。首先，这群身体上长着条纹的毛虫会开始迅速爬' +
        '动，用这种方法干扰入侵者的判断。如果这种做法不管用，这些毛虫会一跃而起跳入空中，悬挂在丝上' +
        '的它们会不断扭动身体。毫无疑问，这一做法非常引人注目，会把它们的天敌吓跑。',
        PestControl:'毛毛虫中还有一种叫剧毒十二点，它的体内含有剧毒。这是一种生活在巴西南部的飞蛾幼虫。尽' +
        '管，我们对毛毛虫的恶心模样早就有心理准备，可是这种巴西毛毛虫恶心的模样还是吓了我一跳。从它身上漂亮' +
        '的保护色便可知道他的毒性也不容小视。据说每年都有许多人因这种毛毛虫毒而死亡。但这种毛毛虫的毒素也是' +
        '一种非常好的抗凝血剂，可以用于突发事故伤口的处理。毛毛虫掉到人身上，其众多的刺毛接触皮肤后可断折，' +
        '毛腔内的毒液便注入皮内，因毒毛的毛腔内充满毒液可引起皮肤剧烈瘙痒与疼痛，有时痛得像被火烧一样。被蛰' +
        '伤的皮肤中心可有小丘疹，痒痛症状可持续数小时或更久。毛毛虫皮炎是在某一部位出现大小一致、且数量较多' +
        '的红色丘疹。',
    },
    {
        id:1006,
        name:'袋蛾',
        englishName:'bagworm',
        item_images:['./img/16.jpg','./img/17.jpg','./img/18.jpg'],
        desc:'袋蛾又名蓑蛾、避债蛾，属鳞翅目、袋蛾科，本科昆虫已知800余种，我国有100余种。常见有' +
        '大袋蛾，分布于甸淮河以南；日本、印度、马来西亚。茶袋蛾、桉袋蛾、白囊袋蛾，分布于我国长江以' +
        '南；日本。为害油桐、油茶、茶、樟、杨、柳、榆、桑、槐、栎（栗）、乌桕、悬铃木、枫杨、木麻' +
        '黄、扁柏及苹果、梨、桃等林木等果树。',
        feature:'成虫雌雄异态，雌虫高度退化，蛆形；雄虫高度特化，有翅。幼虫居于各种各样丝质袋中，' +
        '负袋而行，蛹化于袋中。4种袋蛾形态物征列表如下：大袋蛾茶袋蛾桉袋蛾白囊袋蛾',
        growth:'4-6月，越冬老熟幼虫在袋囊中调转头向下，脱最后一次皮化蛹，蛹头向着排泄口，以利成虫' +
        '羽化爬出袋囊。羽化时间多在下午或晚上，雌成虫羽化后仍留在袋囊内，雄成虫羽化时，将1/2蛹壳留' +
        '在袋囊中。羽化后次日清晨或傍晚交尾。交尾时，雌成虫将头伸出袋囊排泄口外，袋蛾性信息激素释放' +
        '点在头部，以诱引雄成虫，雄成虫交尾时将腹部伸入雌虫袋囊内。交尾后，雌成虫产卵于蛹壳内，并将' +
        '尾端绒毛覆盖在卵堆上。每雌产卵量因种类而异，一般100-300余粒，个别种多达2000粒。卵经15-20' +
        '天孵化，孵化多在白天。初孵幼虫吃去卵壳，从袋囊排泄口蜂拥而出，吐丝下垂，随风吹到枝叶下，咬' +
        '取枝叶表皮吐丝缠身做袋囊；有的种类在袋囊上爬行，咬剥旧袋囊做自己的袋囊。初龄幼虫仅食叶片表' +
        '皮，虫龄增加，食叶量加大，大袋蛾一生食叶36平方厘米，取食时间在早晚及阴天。10月中、下旬，幼' +
        '虫逐渐抽枝梢转移，将袋囊用丝牢牢固定在枝上，袋口用丝封闭越冬',
        PestControl:'病虫病越冬，不构成为害便无事可做。其实，冬季病虫害生存形态和越冬场所相对' +
        '稳定，除部分深藏在树干内部和地下深处的病原物和昆虫以外，很多病虫害越冬休眠期是应该实施防' +
        '治的，既可以结合冬季绿地养护管理——卫生整容，清扫落叶，树木修剪、浇水、防寒，清除越冬病' +
        '原物和害虫，也可实施有针对性地防治如摘茧（黄刺蛾）、挖蛹（国槐尺蠖）、刮囊（介壳虫）、除杂' +
        '（潜芷在杂草及表土层中的多种草坪害虫）、刷白（匿芷在树枝缝，树枝杈、干腐树洞树孔内的多种毒蛾' +
        '幼虫）等，总之，冬季防治的特点是以“动”（防治主体）治“静”（被防治对象），对于降低来年' +
        '病虫害活体密度是十分适宜和有利的。',
    },
    {
        id:1007,
        name:'蜗牛',
        englishName:'snail',
        item_images:['./img/19.jpg','./img/20.jpg','./img/21.jpg'],
        desc:'蜗牛并不是生物学上一个分类的名称，一般是指腹足纲的陆生所有种类。一般西方语言中不区分' +
        '水生的螺类和陆生的蜗牛，汉语中蜗牛只指陆生种类,而广义的蜗牛还包括巨盾蛞蝓。蜗牛是一种包括' +
        '许多不同科、属的动物。取食植物，产卵于土中或者树上。在热带岛屿比较常见，但有的也生存在寒冷' +
        '地区。树栖种类的色泽鲜艳，而地栖的通常几种接近的颜色，一般有条纹。非洲的水晶螺属体型最大' +
        '，多超过20公分。欧洲的大蜗牛属的几个种常作佳肴，尤其在法国。蜗牛是陆地上最常见的软体动物，' +
        '其具有很高的食用和药用价值。',
        feature:'无脊椎动物，软体动物门，腹足纲，肺螺亚纲，蜗牛科。壳一般呈低圆锥形，右旋或左旋。头部' +
        '显著，具有触角2对，大的1对顶端有眼。头的腹面有口，口内具有齿舌，可用以刮取食物。 蜗牛有甲' +
        '壳，形状像小螺，颜色多样化；头有四个触角，走动时头伸出，受惊时则头尾一起缩进甲壳中；蜗牛' +
        '身上有唾涎，能制约蜈蚣、蝎子。六、七月热时会自悬在叶下，往上升高，直到唾涎完了后自己死亡。' +
        '蜗牛是牙齿最多的动物，但它们的牙齿并不是“立体牙”。尽管拥有数万颗牙齿，但它们无法咀嚼食物。' +
        '这是因为它们用齿舌——一个带状结构，上面布满牙齿——碾碎食物，以便消化。一生之中，它们的微小' +
        '牙齿会慢慢磨损钝化，而后被更锋利的新牙取代。蜗牛排泄是在靠近呼吸孔的地方排泄的，叫气孔。它' +
        '会把粪便排在自己的身上，通过腹足和粘液最终将粪便留在地上。',
        growth:'蜗牛喜欢在阴暗潮湿、疏松多腐殖质的环境中生活，昼伏夜出，最怕阳光直射，对环境反应' +
        '敏感，最适合环境：温度16～30℃（23～30℃时，生长发育最快）；空气湿度60%～90%；饲养土湿度' +
        '40%左右；pH为5～7。当温度低于15℃，高于33℃时休眠，低于5℃或高于40℃，则可能被冻死或热' +
        '死。但是各种蜗牛各不相同。蜗牛喜欢钻入疏松的腐殖土中栖息、产卵、调节体内湿度和吸取部分' +
        '养料，时间可长达12小时之久。杂食性和偏食性并存。喜潮湿怕水淹。在潮湿的夜间，并投入湿漉的' +
        '食料，蜗牛的食欲活跃。但水淹可使蜗牛窒息。自食生存性。小蜗牛一孵出，就会爬动和取食，不要' +
        '母体照顾。当受到敌害侵扰时，它的头和足便缩回壳内，并分泌出粘液将壳口封住；当外壳损害致残' +
        '时，它能分泌出某些物质修复肉体和外壳。具有很强的忍耐性。蜗牛具有惊人的生存能力，对冷、热' +
        '、饥饿、干旱有很强的忍耐性。喜恒温养殖。温度恒定在25～28℃之间，生长发育和繁殖旺盛。蜗' +
        '牛在爬行时，还会在地上留下一行粘液，这是它体内分泌出的一种液体，即使走在刀刃上也不会有危险。',
        PestControl:'以保护大豆出苗为目标，在蜗牛群体较大，且即将进入危害始盛期时，采用化学药剂防治' +
        '蜗牛。用多聚甲醛300g，蔗糖50g，5%砷酸钙300g和米糠400g（先在锅内炒香），拌和成黄豆大小的颗粒' +
        '；每亩用6%密达杀螺粒剂0.5～0.6kg或3%灭蜗灵颗粒剂1.5～3kg，拌干细土10～15kg均匀撒施于田间' +
        '。蜗牛喜欢栖息的沟边、湿地适当重施，以最大限度减轻蜗牛危害。',
    },
    {
        id:1001,
        name:'红蜘蛛',
        englishName:'red spider',
        item_images:['./img/1.jpg','./img/2.jpg','./img/3.jpg'],
        desc:'红蜘蛛，又名棉红蜘蛛，俗称大蜘蛛、大龙、砂龙等，学名叶螨，我国的' +
        '种类以朱砂叶螨为主，属蛛形纲、蜱螨目、叶螨科。分布广泛，食性杂，可危害110多种植物。',
        feature:'成螨长0.42～0.52毫米，体色变化大，一般为红色，梨形，体背两侧' +
        '各有黑长斑一块。 雌成螨深红色，体两侧有黑斑，椭圆形。卵圆球形，光滑，' +
        '越冬卵红色，非越冬卵淡黄色较少。幼螨近圆形，有足3对。越冬代幼螨红色，' +
        '非越冬代幼螨黄色。越冬代若螨红色，非越冬代若螨黄色，体两侧有黑斑。' +
        '若螨：有足4对，体侧有明显的块状色素。',
        growth:'主要危害茄科、葫芦科、豆科、百合科等多种蔬菜作物。枣树上红蜘蛛种类' +
        '较多，枣粮间作的枣园中的优势种为截形叶螨，其寄生广泛，包括枣树、棉花' +
        '、玉米、豆类及多种杂草和蔬菜。红蜘蛛每年产一次卵一次约100只左右，一' +
        '个月后开始孵化，母蜘蛛日夜守候，并甘愿当孩子的第一个食物，教会孩子' +
        '捕食，但牺牲自己。1年发生13代，以卵越冬，越冬卵一般在3月初开始孵化' +
        '，4月初全部孵化完毕，越冬后1～3代主要在地面杂草上繁殖为害，4代以后' +
        '即同时在枣树、间作物和杂草上为害，10月中下旬开始进入越冬期。卵主要' +
        '在枣树干皮缝、地面土缝和杂草基部等地越冬，3月初越冬卵孵化后即离开' +
        '越冬部位，向早春萌发的杂草上转移为害，初孵化幼螨在2天内可爬行的最' +
        '远距离约为150米，若2天内找不到食物，即可因饥饿而死亡。4月下旬，当枣' +
        '树萌发时，地面杂草上的部分枣红蜘蛛开始向树上转移为害枣树，转移的主' +
        '要途径是沿树干向上爬行。枣红蜘蛛的各个活动虫态均可转移。',
        PestControl:'对大多数红蜘蛛来说，均属于高温活动型。温度的高低决定了' +
        '红蜘蛛各虫态的发育周期、繁殖速度和产量的多少。干旱炎热的气候条件往' +
        '往会导致其大发生。因此，一定在高温干旱季节来临之前及时防治。害虫的' +
        '自然天敌种类和数量很多，主要有深点食螨瓢虫、束管食螨瓢虫、异色瓢虫' +
        '、大、小草蛉、小花蝽、植绥螨等，它们对控制害虫种群数量起到积极作用' +
        '。因而，在防治害虫时勿伤天敌。使用10%苯丁哒螨灵乳油(如国光红杀)100' +
        '0倍液或10%苯丁哒螨灵乳油(如国光红杀)1000倍液+5.7%甲维盐乳油（如国' +
        '光乐克）3000倍液混合后喷雾防治，建议连用2次，间隔7-10天。',
    },
    {
        id:1003,
        name:'蚂蚁',
        englishName:'ant',
        item_images:['./img/7.jpg','./img/8.jpg','./img/9.jpg'],
        desc:'蚂蚁(ant)是一种昆虫，别名蚁、玄驹、昆蜉、蚍蜉蚂，属节肢动物门，昆虫纲，膜翅目，蚁' +
        '科。蚂蚁的种类繁多，世界上已知有11700多种，有21亚科283属，中国境内已确定的蚂蚁种类有600多种。',
        feature:'蚂蚁的外部形态分头、胸、腹三部分，有六条腿。蚂蚁卵约0.5毫米长，呈不规则的椭圆形' +
        '，乳白色，幼虫蠕虫状半透明。工蚁体形细小，身体长约2.8毫米，全身棕黄，单个蚂蚁要细看才易' +
        '发现。雄、雌蚁体都比较粗大。腹部肥胖，头、胸棕黄色，腹部前半部棕黄色，后半部棕褐色。雄蚁' +
        '体长约5.5毫米。雌蚁体长约6.2毫米。室内环境常见的蚂蚁有小黄家蚁等。',
        growth:'蚂蚁为典型的社会性群体。具有社会性的3大要素：同种个体间能相互合作照顾幼体；具' +
        '明确的劳动分工；在蚁群内至少二个世代重叠（不排除个别情况），且子代能在一段时间内照顾上' +
        '一代。 蚂蚁绝对是建筑专家，蚁巢内有许多分室，这些分室各有用处。蚁窝牢固、安全、舒服，道' +
        '路四通八达，错综复杂。蚁窝外面还有一圈土，还有一些储备食物的地方，里面通风、凉快、冬暖' +
        '夏凉，食物不易坏掉',
        PestControl:'专家建议，家居蚂蚁可先用开水浸淹，然后用洗衣粉投放到沟阻隔等方法防治。也可用' +
        '杀灭蟑螂、蚊虫的喷射剂，这些药品均对小红蚂蚁有杀灭功效。不过小红蚂蚁是一种半社会性昆虫，一' +
        '般的喷射药剂只能杀死群体中出巢活动的工蚁，蚁后、蚁王这些繁殖机器仍在巢中疯狂繁殖。一只蚁' +
        '后每秒钟能生出600只小蚂蚁，因此灭蚁采取全楼集体行动较为理想。最好的办法是选择一种适口性' +
        '好、对蚂蚁没有趋避作用的药剂毒饵，工蚁将毒饵搬回后，能够使巢内蚁王、蚁后及幼虫中毒身亡' +
        '，达到全巢覆灭。',
    },
    {
        id:1005,
        name:'蚜虫',
        englishName:'aphid',
        item_images:['./img/13.jpg','./img/14.jpg','./img/15.jpg'],
        desc:'蚜虫，又称腻虫、蜜虫，是一类植食性昆虫，包括蚜总科（又称蚜虫总科，学名：Aphidoidea）下的所' +
        '有成员。目前已经发现的蚜虫总共有10个科约4400种，其中多数属于蚜科蚜虫也是地球上最具破坏性的害虫之' +
        '一。 其中大约有250种是对于农林业和园艺业危害严重的害虫。蚜虫的大小不一，身长从一到十毫米不等。',
        feature:'体长1.5～4.9毫米，多数约2毫米。有时被蜡粉，但缺蜡片。触角6节，少数5节，罕见4节，感觉圆圈' +
        '形,罕见椭圆形，末节端部常长于基部。眼大，多小眼面，常有突出的3小眼面眼瘤。喙末节短钝至长尖。腹' +
        '部大于头部与胸部之和。前胸与腹部各节常有缘瘤。腹管通常管状，长常大于宽，基部粗，向端部渐细，中' +
        '部或端部有时膨大，顶端常有缘突，表面光滑或有瓦纹或端部有网纹，罕见生有或少或多的毛，罕见腹管环状' +
        '或缺。尾片圆椎形、指形、剑形、三角形、五角形、盔形至半月形。尾板末端圆。表皮光滑、有网纹或皱纹或' +
        '由微刺或颗粒组成的斑纹。体毛尖锐或顶端膨大为头状或扇状。有翅蚜触角通常6节，第3或3及4或3～5节有次' +
        '生感觉圈。前翅中脉通常分为3支，少数分为2支。后翅通常有肘脉2支，罕见后翅变小，翅脉退化。翅脉有时' +
        '镶黑边。 [1]  身体半透明，大部分是绿色或是白色。',
        growth:'蚜虫腹部有管状突起(腹管)，蚜虫具有一对腹管，用于排出可迅速硬化的防御液，成份为甘油三酸脂' +
        '，腹管通常管状，长常大于宽，基部粗，吸食植物汁液，为植物大害虫。不仅阻碍植物生长，形成虫瘿，传布' +
        '病毒，而且造成花、叶、芽畸形。生活史复杂，无翅雌虫(干母〔stem mother〕)在夏季营孤雌生殖，卵胎生' +
        '，产幼蚜。植株上的蚜虫过密时，有的长出两对大型膜质翅，寻找新宿主。夏末出现雌蚜虫和雄蚜虫，交配后' +
        '，雌蚜虫产卵，以卵越冬，最终产生干母。温暖地区可无卵期。蚜虫有蜡腺分泌物，所以许多蚜虫外表像白羊' +
        '毛球。',
        PestControl:'发现大量蚜虫时，及时喷施农药。用50%马拉松乳剂 1000 倍液，或 50%杀螟松乳剂 1000' +
        '倍液，或 50%抗蚜威可湿性粉剂 3000 倍液，或 2.5%溴氰菊酯乳剂 3000 倍液，或 2.5%灭扫利乳剂 3000' +
        ' 倍液，或 40%吡虫啉水溶剂 1500～2000 倍液等，喷洒植株 1～2 次；用 1:6—1:8 的比例配制辣椒水（' +
        '煮半小时左右），或用 1:20—1:30 的比例配制洗衣粉水喷洒，或用 1:20:400 的比例配制洗衣粉、尿素、' +
        '水混合溶液喷洒，连续喷洒植株 2～3 次；对桃粉蚜一类本身披有蜡粉的蚜虫，施用任何药剂时，均应加入1' +
        '%肥皂水或洗衣粉,增加粘附力，提高防治效果',
    },
];

const curAvator = '../img/cat.jpg';

var comments = [
    {
        id:1,
        avator:'../img/avator1.jpg',
        name:'从零开始',
        text:'汉皇重色思倾国，御宇多年求不得',
        time:'2018-06-10 15:00',
    },
    {
        id:2,
        avator:'../img/avator5.jpg',
        name:'KAI(SO4)2·12H20',
        text:'杨家有女初长成，养在深闺人不知',
        time:'2018-06-10 15:00',
    },
    {
        id:3,
        avator:'../img/avator4.jpg',
        name:'啷里格啷',
        text:'天生丽质难自弃，一朝选在君王侧',
        time:'2018-06-10 15:00',
    }
]

var c

var searchArr= [
    {id:5,name:'梅'},
    {id:6,name:'榕树'},
    {id:3,name:'竹子'},
    {id:4,name:'柳树'},
    {id:1,name:'榴莲树'},
    {id:2,name:'桂花树'},
    {id:1001,name:'红蜘蛛'},
    {id:1002,name:'蚧壳虫'},
    {id:1003,name:'蚂蚁'},
    {id:1004,name:'毛毛虫'},
    {id:1005,name:'蚜虫'},
    {id:1006,name:'袋蛾'},
    {id:1007,name:'蜗牛'},
];

function getItemByID(id) {
        var allitems = new Array();
        allitems.push(hotitems);
        allitems.push(wormitems)
        console.log(allitems);
        for(var i = 0;i < 2;i++)
        {
            for (item in allitems[i]) {
                if (allitems[i][item].id === id) {
                    return allitems[i][item];
                }
            }
        }
        return null;
};

function getComments(id) {
    return comments;
}


function getQueryString(name)
{
    var reg = new RegExp("(^|&)"+ name +"=([^&]*)(&|$)");
    var r = window.location.search.substr(1).match(reg);
    if(r!=null)return  unescape(r[2]); return null;
}

function getSearchArr() {
    return searchArr;
}

function getHotestItem() {
    var temp = new Array();
    temp.push(hotitems.slice(0,10));
    for(var t in temp[0])
    {
        temp[0][t].item_images = temp[0][t].item_images[0];
        temp[0][t].desc = temp[0][t].desc.substr(0,50)+'...';
    }
    return temp[0];
}

function getNewestItem() {
    var temp = new Array();
    temp.push(wormitems.slice(0,10));
    for(var t in temp[0])
    {
        temp[0][t].item_images = temp[0][t].item_images[0];
        temp[0][t].desc = temp[0][t].desc.substr(0,50)+'...';
    }
    return temp[0];
}
